INSERT INTO bookstore.Publishing(name, address, city) VALUES 
    ('Лабиринт', '2-й Рощинский проезд, 8с4', 'Москва'),
    ('Эксмо', 'улица Зорге, дом 1', 'Москва'),
    ('Росмэн', 'Ленинградский проспект, д. 36', 'Москва'),
    ('Просвещение', 'Краснопролетарская, д. 16', 'Москва'),
    ('Bubble Comics', 'ул Бутырский Вал, д 68/70', 'Москва'),
    ('Алтапресс', 'Короленко, 107', 'Барнаул'),
    ('Ленинградское издательство', 'Менделеевская ул., 9', 'Санкт-Петербург'),
    ('Речь', 'лн. 11-я В.О., д. 26', 'Санкт-Петербург'),
    ('Татарское книжное издательство', 'ул. Баумана, 51', 'Казань'),
    ('Калининградская книга', 'ул. Карла Маркса, 18', 'Калининград');


INSERT INTO bookstore.Warehouse(city, address, phone_number, capacity, current_stock) VALUES
    ('Москва', 'улица Зорге, дом -100', '+7-111-111-11-11', 500, 66),
    ('Москва', 'Короленко, -50', '+7-222-222-22-22', 100, 96),
    ('Москва', 'улица Зорге, дом -200', '+7-333-333-33-33', 2000, 212),
    ('Москва', 'ул. Баумана, 0', '+7-444-444-44-44', 200, 110),
    ('Казань', 'Петербургская, -1', '+7-555-555-55-55', 3456, 187),
    ('Калининград', 'ул. Карла Маркса, -18', '+7-666-666-66-66', 1386, 39),
    ('Барнаул', 'Короленко, 1005', '+7-777-777-77-77', 1005, 500),
    ('Санкт-Петербург', 'ул. Замшина, д. 10000', '+7-888-888-88-88', 533, 239);


INSERT INTO bookstore.Delivery_service (name) VALUES 
    ('cdek'),
    ('Dpd'),
    ('ЯндексДоставка'),
    ('spb.dostavista'),
    ('Boxberry');
    
INSERT INTO bookstore.Buyer(name, email, phone_number, valid_from_DTTM,  valid_to_DTTM) VALUES
    ('Диана', 'mediana@work.ru', '+7-999-999-99-99', '2020-12-01', '2022-12-05'),
    ('Диана', 'mediana@work.ru', '+7-000-000-00-00', '2022-12-05', '2024-12-05'),
    ('Диана', 'mediana105@work.ru', '+7-000-000-00-00', '2024-12-05', NULL),
    ('Екатерина', 'isaeva@work.ru', '+7-123-999-99-99', '2024-12-01', NULL),
    ('Алина', 'mukha@work.ru', '+7-123-000-00-00', '2020-06-05', '2022-11-11'),
    ('Алина', 'mukha@work.ru', '+7-111-000-00-00', '2022-11-11', NULL),
    ('Petya Petrov', 'petya@yandex.ru', '+7-111-111-00-00', '2020-01-01', '2022-01-11'),
    ('Vasya Vasiliev', 'vasya@yandex.ru', '+7-111-111-11-00', '2022-01-01', NULL),
    ('Ivan Ivanov', 'vanya@yandex.ru', '+7-222-222-22-00', '2020-06-01', NULL),
    ('Igor', 'igor@work.com', '+7-111-111-11-22', '2023-05-01', NULL);

INSERT INTO bookstore.Book(publishing_id, name, author, price) VALUES
    (1, 'Теория всего', 'Стивен Хокинг', 1500),
    (1, 'Алиса в Зазеркалье', 'Льюис Кэрролл', 670),
    (1, 'Записки юного врача', 'М.А.Булгаков', 500);

INSERT INTO bookstore.Book(publishing_id, name, author, price) VALUES    
    (2, 'Цветы для Элджернона', 'Дэниел Киз', 450),
    (2, 'Преступление и наказание', 'Ф.М.Достоевский', 430),
    (2, 'Маленький принц', 'А.Д.Сент-Экзюпери', 500),
    (2, 'Алиса в Зазеркалье', 'Льюис Кэрролл', 900);

INSERT INTO bookstore.Book(publishing_id, name, author, price) VALUES
    (3, 'Гарри Поттер и философский камень', 'Дж. К. Роулинг', 1000),
    (3, 'Гарри Поттер и Тайная комната', 'Дж. К. Роулинг', 1200),
    (3, 'Гарри Поттер и узник Азкабана', 'Дж. К. Роулинг', 1150),
    (3, 'Гарри Поттер и Кубок огня', 'Дж. К. Роулинг', 890),
    (3, 'Гарри Поттер и Орден Феникса', 'Дж. К. Роулинг', 1100),
    (3, 'Гарри Поттер и Принц-полукровка', 'Дж. К. Роулинг', 990),
    (3, 'Гарри Поттер и Дары Смерти', 'Дж. К. Роулинг', 900);

INSERT INTO bookstore.Book(publishing_id, name, author, price) VALUES
    (4, 'Всеобщая история 6 класс', 'Е.А.Крючкова', 300),
    (4, 'Немецкий язык 9 класс', 'М.М.Аверин', 400),
    (4, 'Математика 2 класс', 'В.Н.Рудницкая', 350);

INSERT INTO bookstore.Book(publishing_id, name, author, price) VALUES
    (5, 'Комикс Чумной доктор. Том 1. Капкан', 'Наталия Воронцова', 600),
    (5, 'Ловец бабочек: книга комиксов', 'Анастасия Ким', 750),
    (5, 'Инок. Наследие', 'Роман Котков', 500),
    (5, 'Найди Дракона', 'Роман Котков', 500);

INSERT INTO bookstore.Book(publishing_id, name, author, price) VALUES
    (6, 'Поющая радуга', 'Ирина Цхай', 300);

INSERT INTO bookstore.Book(publishing_id, name, author, price) VALUES
    (7, 'Заря противоборства', 'Андрей Один', 500),
    (7, 'Планета луунов', 'Живой А.Я.', 400);

INSERT INTO bookstore.Book(publishing_id, name, author, price) VALUES
    (8, 'Девочка-свеча', 'Софья Прокофьева', 700);

INSERT INTO bookstore.Book(publishing_id, name, author, price) VALUES
    (9, 'Су анасы', 'Габдулла Тукай', 400);

INSERT INTO bookstore.Book(publishing_id, name, author, price) VALUES
    (10, 'Мальчик с янтарного берега', 'Мартин Бергау', 300);

INSERT INTO bookstore.Genre(name) VALUES
    ('Детектив'),
    ('Фантастика'),
    ('Фэнтези'),
    ('Реализм'),
    ('Триллер'),
    ('Ужасы'),
    ('Классика'),
    ('Драма'),
    ('Комедия'),
    ('Поэзия'),
    ('Учебная литература'),
    ('Сказка'),
    ('Трагедия'),
    ('Роман'),
    ('Рассказы'),
    ('Комиксы');

INSERT INTO bookstore.Sale(buyer_id, delivery_service_id, warehouse_id, address, DTTM) VALUES
    (1, 1, 1, 'г. Москва, ул. Карла Маркса, 1', '2021-12-12'),
    (2, 3, 2, 'г. Набережные Челны, 18/01',  '2024-11-01'), 
    (2, 3, 2, 'г. Казань, ул. Петербургская, 1','2024-09-12'), 
    (4, 1, 7, 'г. Москва, улица Зорге, 1','2024-12-01'),
    (5, 4, 8, 'г. Санкт-Петербург, ул. Кантемировская', '2021-11-11'),
    (1, 1, 1, 'г. Москва, ул. Карла Маркса, 2', '2022-12-12'),
    (1, 2, 1, 'г. Москва, ул. Карла Маркса, 2', '2022-12-11'),
    (2, 2, 1, 'г. Набережные Челны, 18/01', '2024-11-02');


INSERT INTO bookstore.Book_x_Warehouse(warehouse_id, book_id, quantity) VALUES
    (1, 1, 10), (1, 5, 5), (1, 7, 4), (1, 10, 5), (1, 11, 8), (1, 16, 20), (1, 18, 4), (1, 19, 10),
    (2, 6, 17), (2, 7, 50), (2, 15, 4), (2, 16, 6), (2, 17, 19),
    (3, 2, 101), (3, 5, 20), (3, 18, 11), (3, 20, 45), (3, 21, 5), (3, 3, 30), 
    (4, 7, 5), (4, 8, 4), (4, 9, 1), (4, 10, 100), 
    (5, 26, 30), (5, 12, 4), (5, 13, 18), (5, 1, 35), (5, 2, 100), 
    (6, 27, 4), (6, 15, 5), (6, 16, 6), (6, 17, 7), (6, 13, 8), (6, 14, 9), 
    (7, 22, 100), (7, 4, 200), (7, 5, 100), (7, 6, 100), 
    (8, 1, 100), (8, 5, 48), (8, 9, 52), (8, 15, 39);

INSERT INTO bookstore.Warehouse_x_Delivery_service(warehouse_id, delivery_service_id) VALUES
    (1, 1), (1, 2), (2, 1), (2, 3), (2, 5), (3, 1), (4, 1), (4, 5), (5, 1), 
    (5, 2), (5, 3), (6, 1), (6, 3), (7, 1), (7, 3), (8, 1), (8, 4), (8, 5);

INSERT INTO bookstore.Book_x_Sale(book_id, sale_id, sale_price, quantity) VALUES
    (1, 1, 1500, 2), (7 , 2, 800, 1), (6 , 2, 500, 1), (8, 3, 1000, 2), (22, 4, 400, 1), (15, 5, 300, 1), 
    (9, 5, 200, 1), (1, 6, 800, 20), (1, 7, 300, 5), (7, 8, 800, 1);


INSERT INTO bookstore.Warehouse_x_publishing(warehouse_id, publishing_id) VALUES
    (1, 1), (1, 2), (1, 3), (1, 4), (1, 5), (2, 2), (2, 4), (3, 1), (3, 2), (3, 5), (4, 2), (4, 3), 
    (5, 9), (5, 1), (5, 3), (6, 10), (6, 4), (6, 3), (7, 6), (7, 2), (8, 1), (8, 2), (8, 3), (8, 4);
    
INSERT INTO bookstore.Book_x_genre(book_id, genre_id) VALUES
    (1, 11), (2, 3), (3, 15), (3, 7), (4, 14), (4, 2), (5, 7), (5, 14), (5, 8), (6, 3), (6, 12), 
    (7, 3), (8, 3), (8, 14), (9, 3), (9, 14), (10, 3), (10, 14), (11, 3), (11, 14), (12, 3), (12, 14),
    (13, 3), (13, 14), (14, 3), (14, 14), (15, 11), (16, 11), (17, 11), (18, 16), (18, 4), (18, 8), (19, 3), 
    (19, 16), (20, 3), (20, 16), (21,3), (21,16), (22, 12), (23, 14), (24, 2), (25, 15), (26, 12), (27, 8), (27, 4); 
